#Filippos-Athanasios Pelekanos 6182
#Φίλιππος-Αθανάσιος Πελεκάνος 6182

#!/bin/bash

###################################################
#ΧΑΡΤΗΣ ΜΕΤΑΒΛΗΤΩΝ:
#args = αριθμος εισόδων απο τερματικό
#OPTS = εγκυρες τιμες εισοδου για την getopt
#FILE = αρχειο εισοδου
#ID = id εισοδου
#ED_ID = id προς επεξεργασια για την --edit
#COL = τιμη της στηλης που θα επεξεργαστει με την --edit
#VAL = τιμη με την οποια θα αντικατασταθει η στηλη COL
#ID_FLAG = boolean μεταβλητη για το αν δοθηκε ID στην εισοδο με την χρηση της παραμετρου -id
#FN_FLAG - boolean μεταβλητη για τον ελεγχο της εντολης --firstnames
#LN_FLAG = boolean μεταβλητη για τον ελεγχο της εντολής --lastnames
#DT_FLAG = boolean μεταβλητη για την υπαρξη εισοδου ημερομηνιας απο τις παραμετρους --bornsince/--bornuntil
#ED_FLAG = boolean μεταβλητη για τον ελεγχο της εντολης --edit
#BASE = το κατωτερο οριο για την συγκριση ημερομηνιων με την --born-since. Αρχικοποιειται με την τιμη 0000-00-00
#THRESH = το ανωτερο οριο για την συγκριση ημερομηνιων με την --born-until. Αρχικοποιειται με την τιμη 9999-99-99
#BR_FLAG = boolean μεταβλητη για τον ελεγχο της παραμετρου --browsers
###################################################


###################################################
#Έκτυπωση του αριθμου μητρωου σε περιπτωση που δεν υπαρχει καμια εντολη στην εισοδο του προγραμματος
###################################################


if [ $# -eq 0 ]; then
		echo "6182"
	fi

args=$# #αποθηκευση του αρχικου αριθμου εισοδων πριν επεξεργαστουν απο την getopt

###################################################
#Αλλαγή των εισόδων απο τερματικό ετσι ώστε η -id να μετατραπει σε -i
#Αυτο επιτυγχάνεται με την αποθηκευση του string των εισοδων σε μια μεταβλητη
#και με την αντικατασταση καθε -id με -i χρησιμοποιωντας  bash string manipulation
###################################################

	old_args=$@
	new_args="${old_args/-id/-i}"

	set -- $new_args

###################################################
#Εισοδοι της getopt
###################################################
OPTS=`getopt -o f:i: --long firstnames,lastnames,born-since:,born-until:,browsers,edit: -- "$@"` #STRING ΕΙΣΟΔΩΝ ΓΙΑ ΤΗΝ GETOPT
eval set -- "$OPTS"


###################################################
#Αρχικοποίηση μεταβλητών
###################################################
	FILE="this.is.not.a.file"
	ID=0
	BASE="0000-00-00"
	THRESH="9999-99-99"
	ED_ID=0
	VAL=
	COL=
	ID_FLAG=false
	FN_FLAG=false
	LN_FLAG=false
	DT_FLAG=false
	BR_FLAG=false
	ED_FLAG=false

###################################################
#Συναρτηση getopt για τις εισοδους
###################################################

while true; do
	case "$1" in
		-f) FILE=$2; shift 2 ;;
		-i) ID=$2; ID_FLAG=true; shift 2 ;;
		--firstnames) FN_FLAG=true; shift ;;
		--lastnames) LN_FLAG=true; shift ;;
		--born-since) BASE=$2; DT_FLAG=true; shift 2;;
		--born-until) THRESH=$2; DT_FLAG=true; shift 2;;
		--browsers) BR_FLAG=true; shift ;;
		--edit)
			#echo "$1 $2 $3 $4 $5 $6 $7";
			if [ $4 -gt 1 ] && [ $4 -lt 9 ]; then
				ED_ID=$2
				COL=$4
				VAL="$5"
				ED_FLAG=true
			fi; shift 2;;
		--) shift ; break ;;
		*) exit 1 ;;
	esac
done

####################################################
#Ελεγχος εισόδου για την υπαρξη του αρχειου που δινεται απο την -f
#Έξοδος σε περιπτωση μη εγκυρου αρχείου
####################################################

if [ ! -f $FILE ] && [ ! $args -eq 0 ]; then
	echo "Error: Invalid filename. Please provide a valid existing filename using the argument -f <path/to/file>"#	exit 1
fi

####################################################
#Εκτύπωση των περιεχομενων του αρχειου εισοδου 
#	(Υποερώτημα Α)
####################################################

if [ $args -eq 2 ]; then
	grep -v "^#" $FILE #Το grep χρησιμοποιειται για να παραλειψει τα σχολια απο το αρχειο που δοθηκε αναζητωντας τις γραμμες που αρχιζουν με #
fi			   #και παραλειποντας τες με την εντολη -v

####################################################
#Εκτυπωση των στοιχειων του χρηστη στον οποιον αντιστοιχει η τιμη της μεταβλητης ID
#	(Υποερωτημα B)
####################################################

if [ "$ID_FLAG" = true ]; then
	awk -v id="$ID" -F '|' '$1==id { print $3, $2, $5 }' $FILE #εαν το πεδιο $1 της awk αντιστοιχει στο id που δοθηκε τοτε τυπωνει τα πεδια $3, $2, $5 με αυτην την σειρα
fi

####################################################
#Εκτύπωση ταξινομημενων firstname ενα ανα σειρα 
#	(Υποερώτημα C)
####################################################

if [ "$FN_FLAG" = true ]; then
	grep -v "^#" $FILE | awk -F '|' '{ print $3 }' | sort -u #το sort στοιχιζει τα στοιχεια της εισοδου με αλφαβιτηκη σειρα
fi								 # η εντολη -u τυπωνει μονο τα διακρια στοιχεια

####################################################
#Εκτύπωση ταξινομημένων lastname ενα ανα σειρα 
#	(Υποερώτημα D)
####################################################

if [ "$LN_FLAG" = true ]; then
	grep -v "^#" $FILE | awk -F '|' '{ print $2 }' | sort -u
fi

####################################################
#Εκτυπωση των ημερομηνιων γεννησης απο bornsince-bornuntil
#	(Υποερωτημα Ε)
####################################################

if [ "$DT_FLAG" = true ]; then
	grep -v "^#" $FILE | awk -F '|' -v base="$BASE" -v thresh="$THRESH" '{ if (base <= $5 && thresh >= $5) print $0 }' #η awk καλειται να τυπωσει μια σειρα ($0)
fi															   # μονο εαν το πεδιο $5 ανηκει στο ευρος τιμων [BASE-THRESH]

####################################################
#Εκτυπωση των Browsers με τον αριθμο των χρηστων που τους χρησιμοποιουν 
#	(Υποερωτημα F)
####################################################

if [ "$BR_FLAG" = true ]; then
	grep -v "^#" $FILE | awk -F '|' '{ print $8 }' | sort | uniq -c | awk '{for (i=2;i<=NF;i++) printf "%s ", $i; print $1}' 
fi 	#	Aφου η awk προσπελασει μονο το πεδιο $8 του αρχειου στο stream, τα στοιχεια του ταξινομουνται με αλφαβητικη σειρα με την sort
	# Υστερα αριθμουνται με την uniq -c και βρισκονται στην μορφη <number> <browser name>. Περνανε αλλη μια φορα απο την awk η οποια αυτην την φορα
	# τυπωνει τα πεδια $2 εως το τέλος (NF) με ενα κενο αναμεσα, και τελος τυπώνει το πρωτο πεδίο $1 οπου βρισκεται και ο αριθμος χρηστων του browser

####################################################
#Επεξεργασία στοιχειων χρηστη
#	(Υποερωτημα G)
####################################################
if [ "$ED_FLAG" = true ]; then
	awk -F '|' -vOFS='|' -v id=$ED_ID -v col=$COL -v val="$VAL" '{ if ($1==id) $col=val; print }' $FILE > hw1.tmp && mv hw1.tmp $FILE
fi	#	η -vOFS καθοριζει το delimeter που θα περασει στην εξοδο. Η awk εδω γραφει το επεξεργασμενο κειμενο στο προσωρινο αρχειο hw1.tmp
	# πριν την αντιγραψει στο αρχειο της εισοδου.
